admin/app/controllers/getting_started_controller.rb

INSERT INTO `admins` (`email`, `created_at`, `updated_at`, `password`, `username`) VALUES('', '2016-04-27 09:21:32', '2016-04-27 09:21:32', 'wesley', 'wesley')
---
  def step1 # Admin User
    @admin = Admin.new
    if request.post?
      @admin = Admin.new
      @admin.attributes = params[:admin]
      if @admin.save